app/views/entertainments/ent_enter_sentences.html.erb


<div class="last"> <%= Entertainment.last %> </div>
---
SELECT  "entertainments".* FROM "entertainments" ORDER BY "entertainments"."id" DESC LIMIT $1  [["LIMIT", 1]]