app/views/relationships/rel_enter_sentences.html.erb

SELECT  "relationships".* FROM "relationships" ORDER BY "relationships"."id" DESC LIMIT $1  [["LIMIT", 1]]
---

<div class="last"> <%= Relationships.last %> </div>