app/views/numbers/num_enter_sentences.html.erb

SELECT  "numbers".* FROM "numbers" ORDER BY "numbers"."id" DESC LIMIT $1  [["LIMIT", 1]]
---

<div class="last"> <%= Numbers.last %> </div>