app/views/definitions/def_enter_sentences.html.erb


<div class="last"> <%= Definition.last %> </div>
---
SELECT  "definitions".* FROM "definitions" ORDER BY "definitions"."id" DESC LIMIT $1  [["LIMIT", 1]]