app/controllers/definitions_controller.rb

  def new_iteration

    @definition = Definition.new
    @definition.sentence = params[:text]

    s = Sentence.find_by(sentence_type: 'definition')
    @definition.sentence_id = s.id
    @definition.save!
---
SELECT  "sentences".* FROM "sentences" WHERE "sentences"."sentence_type" = $1 LIMIT $2  [["sentence_type", "definition"], ["LIMIT", 1]]
INSERT INTO "definitions" ("sentence", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["sentence", "afjd;fe"], ["created_at", "2018-03-11 01:17:21.026589"], ["updated_at", "2018-03-11 01:17:21.026589"]]

  def def_enter_sentences
    @sentence = Sentence.where({sentence_type: 'definition'})
---
SELECT "sentences".* FROM "sentences" WHERE "sentences"."sentence_type" = $1  [["sentence_type", "definition"]]

  def delete_all
    @definition = Definition.delete_all()
---
DELETE FROM "definitions"

  def index
    @definitions = Definition.all
    @sentence = Sentence.where({sentence_type: 'definition'})
---
SELECT "definitions".* FROM "definitions"
SELECT "sentences".* FROM "sentences" WHERE "sentences"."sentence_type" = $1  [["sentence_type", "definition"]]