app/controllers/entertainments_controller.rb

SELECT  "sentences".* FROM "sentences" WHERE "sentences"."sentence_type" = $1 LIMIT $2  [["sentence_type", "entertainment"], ["LIMIT", 1]]
INSERT INTO "entertainments" ("sentence", "sentence_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sentence", "dfafdafd"], ["sentence_id", 3], ["created_at", "2018-03-11 02:37:06.531846"], ["updated_at", "2018-03-11 02:37:06.531846"]]
---
  def new_iteration

    @entertainment = Entertainment.new
    @entertainment.sentence = params[:text]

    s = Sentence.find_by(sentence_type: 'entertainment')
    @entertainment.sentence_id = s.id
    @entertainment.save!

SELECT "sentences".* FROM "sentences" WHERE "sentences"."sentence_type" = $1  [["sentence_type", "entertainment"]]
---
  def ent_enter_sentences
    @sentence = Sentence.where({sentence_type: 'entertainment'})

DELETE FROM "entertainments"
---
  def delete_all
    @entertainment = Entertainment.delete_all()

SELECT "entertainments".* FROM "entertainments"
SELECT "sentences".* FROM "sentences" WHERE "sentences"."sentence_type" = $1  [["sentence_type", "entertainment"]]
---
  def index
    @entertainments = Entertainment.all
    @sentence = Sentence.where({sentence_type: 'entertainment'})