app/controllers/numbers_controller.rb

SELECT "sentences".* FROM "sentences" WHERE "sentences"."sentence_type" = $1  [["sentence_type", "number"]]
---
 def num_enter_sentences
   @sentence = Sentence.where({sentence_type: 'number'})

DELETE FROM "numbers"
---
 def delete_all
   @numbers = Number.delete_all()

SELECT "numbers".* FROM "numbers"
SELECT "sentences".* FROM "sentences" WHERE "sentences"."sentence_type" = $1  [["sentence_type", "entertainment"]]
---
  def index
    @numbers = Number.all
    @sentence = Sentence.where({sentence_type: 'number'})