app/controllers/relationships_controller.rb

SELECT  "sentences".* FROM "sentences" WHERE "sentences"."sentence_type" = $1 LIMIT $2  [["sentence_type", "relationship"], ["LIMIT", 1]]
INSERT INTO "relationships" ("sentence", "sentence_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sentence", "I have no idea can't remember....."], ["sentence_id", 4], ["created_at", "2018-03-11 02:18:31.990833"], ["updated_at", "2018-03-11 02:18:31.990833"]]
---
  def new_iteration
    @relationship = Relationship.new
    @relationship.sentence = params[:text]

    s = Sentence.find_by(sentence_type: 'relationship')
    @relationship.sentence_id = s.id
    @relationship.save!

SELECT "sentences".* FROM "sentences" WHERE "sentences"."sentence_type" = $1  [["sentence_type", "relationship"]]
---
  def rel_enter_sentences
    @sentence = Sentence.where({sentence_type: 'relationship'})

DELETE FROM "relationships"
---
  def delete_all
    @relationship = Relationship.delete_all()

SELECT "relationships".* FROM "relationships"
SELECT "sentences".* FROM "sentences" WHERE "sentences"."sentence_type" = $1  [["sentence_type", "entertainment"]]
---
  def index
    @relationships = Relationship.all
    @sentence = Sentence.where({sentence_type: 'relationship'})