app/controllers/sentences_controller.rb

  def index
    @sentences = Sentence.all
---
SELECT "sentences".* FROM "sentences"